{
               "articles": [
                 {
                   "title": "Climate Change and Rising Sea Levels",
                   "description": "Rising sea levels are one of the most significant impacts of climate change, threatening coastal communities worldwide.",
                   "urlToImage": "https://via.placeholder.com/150",
                   "content": "Rising sea levels are caused by the melting of polar ice caps and the expansion of seawater as it warms. This phenomenon is expected to displace millions of people in the coming decades."
                 },
                 {
                   "title": "Extreme Weather Events",
                   "description": "Climate change is increasing the frequency and intensity of extreme weather events such as hurricanes, droughts, and floods.",
                   "urlToImage": "https://via.placeholder.com/150",
                   "content": "Extreme weather events are becoming more common due to the warming of the Earth's atmosphere. These events can cause widespread destruction and loss of life."
                 },
                 {
                   "title": "Ecosystem Disruption",
                   "description": "Climate change is disrupting ecosystems around the world, leading to the loss of biodiversity and the collapse of food chains.",
                   "urlToImage": "https://via.placeholder.com/150",
                   "content": "Ecosystems are highly sensitive to changes in temperature and precipitation. As these factors shift due to climate change, many species are struggling to adapt."
                 },
                 {
                   "title": "The Role of Fossil Fuels",
                   "description": "The burning of fossil fuels is the primary driver of climate change, releasing large amounts of greenhouse gases into the atmosphere.",
                   "urlToImage": "https://via.placeholder.com/150",
                   "content": "Fossil fuels such as coal, oil, and natural gas are the main sources of carbon dioxide emissions. Reducing our reliance on these fuels is crucial to mitigating climate change."
                 },
                 {
                   "title": "Renewable Energy Solutions",
                   "description": "Switching to renewable energy sources like solar and wind power is essential for reducing greenhouse gas emissions.",
                   "urlToImage": "https://via.placeholder.com/150",
                   "content": "Renewable energy technologies are becoming more efficient and affordable, making them a viable alternative to fossil fuels."
                 }
               ]
             }